plot/stage2/least_conn_compose2.txt
[root@fa21-cs523-17 wrk2]# ./wrk -D exp -t 1 -c 100 -d 20 -L -s ./scripts/media-microservices/compose-review.lua http://localhost:8080/wrk2-api/review/compose -R 800
Running 20s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread calibration: mean lat.: 15.978ms, rate sampling interval: 52ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.70ms    6.82ms  36.93ms   75.99%
    Req/Sec   800.55    117.91     1.08k    71.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.29ms
 75.000%   16.74ms
 90.000%   22.21ms
 99.000%   36.93ms
 99.900%   50.69ms
 99.990%   68.42ms
 99.999%   70.46ms
100.000%   70.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.715     0.000000            1         1.00
       6.727     0.100000          785         1.11
       8.247     0.200000         1572         1.25
       9.567     0.300000         2360         1.43
      10.871     0.400000         3143         1.67
      12.287     0.500000         3930         2.00
      13.015     0.550000         4319         2.22
      13.815     0.600000         4710         2.50
      14.639     0.650000         5103         2.86
      15.631     0.700000         5495         3.33
      16.735     0.750000         5887         4.00
      17.375     0.775000         6087         4.44
      18.143     0.800000         6280         5.00
      18.895     0.825000         6478         5.71
      19.775     0.850000         6673         6.67
      20.831     0.875000         6869         8.00
      21.423     0.887500         6968         8.89
      22.239     0.900000         7066        10.00
      23.071     0.912500         7163        11.43
      24.207     0.925000         7260        13.33
      25.343     0.937500         7358        16.00
      26.127     0.943750         7408        17.78
      26.703     0.950000         7456        20.00
      27.663     0.956250         7505        22.86
      28.751     0.962500         7555        26.67
      30.063     0.968750         7604        32.00
      30.495     0.971875         7628        35.56
      31.055     0.975000         7653        40.00
      32.191     0.978125         7677        45.71
      33.183     0.981250         7701        53.33
      34.463     0.984375         7726        64.00
      35.135     0.985938         7738        71.11
      36.095     0.987500         7750        80.00
      36.543     0.989062         7763        91.43
      37.631     0.990625         7776       106.67
      38.975     0.992188         7787       128.00
      39.743     0.992969         7793       142.22
      40.703     0.993750         7800       160.00
      41.535     0.994531         7806       182.86
      42.495     0.995313         7812       213.33
      44.127     0.996094         7818       256.00
      44.447     0.996484         7821       284.44
      45.151     0.996875         7824       320.00
      45.375     0.997266         7827       365.71
      45.919     0.997656         7830       426.67
      46.943     0.998047         7833       512.00
      47.295     0.998242         7835       568.89
      47.839     0.998437         7836       640.00
      48.287     0.998633         7838       731.43
      49.087     0.998828         7839       853.33
      52.127     0.999023         7841      1024.00
      52.319     0.999121         7842      1137.78
      52.319     0.999219         7842      1280.00
      52.927     0.999316         7843      1462.86
      55.679     0.999414         7844      1706.67
      57.855     0.999512         7845      2048.00
      57.855     0.999561         7845      2275.56
      57.855     0.999609         7845      2560.00
      61.919     0.999658         7846      2925.71
      61.919     0.999707         7846      3413.33
      68.415     0.999756         7847      4096.00
      68.415     0.999780         7847      4551.11
      68.415     0.999805         7847      5120.00
      68.415     0.999829         7847      5851.43
      68.415     0.999854         7847      6826.67
      70.463     0.999878         7848      8192.00
      70.463     1.000000         7848          inf
#[Mean    =       13.699, StdDeviation   =        6.822]
#[Max     =       70.400, Total count    =         7848]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15865 requests in 20.00s, 5.48MB read
  Non-2xx or 3xx responses: 15865
Requests/sec:    793.26
Transfer/sec:    280.43KB



[root@fa21-cs523-17 wrk2]# ./wrk -D exp -t 1 -c 100 -d 20 -L -s ./scripts/media-microservices/compose-review.lua http://localhost:8080/wrk2-api/review/compose -R 800
Running 20s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread calibration: mean lat.: 15.143ms, rate sampling interval: 51ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.21ms    7.27ms  38.78ms   74.50%
    Req/Sec   799.18    132.84     1.08k    66.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.65ms
 75.000%   17.69ms
 90.000%   23.74ms
 99.000%   38.78ms
 99.900%   50.11ms
 99.990%   61.28ms
 99.999%   67.33ms
100.000%   67.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.291     0.000000            1         1.00
       6.691     0.100000          785         1.11
       8.223     0.200000         1570         1.25
       9.687     0.300000         2353         1.43
      11.111     0.400000         3135         1.67
      12.647     0.500000         3922         2.00
      13.399     0.550000         4307         2.22
      14.263     0.600000         4700         2.50
      15.247     0.650000         5089         2.86
      16.431     0.700000         5482         3.33
      17.695     0.750000         5874         4.00
      18.415     0.775000         6067         4.44
      19.279     0.800000         6264         5.00
      20.095     0.825000         6459         5.71
      21.071     0.850000         6656         6.67
      22.287     0.875000         6851         8.00
      22.991     0.887500         6948         8.89
      23.759     0.900000         7051        10.00
      24.767     0.912500         7145        11.43
      25.839     0.925000         7242        13.33
      26.927     0.937500         7340        16.00
      27.567     0.943750         7388        17.78
      28.303     0.950000         7437        20.00
      29.039     0.956250         7489        22.86
      29.967     0.962500         7535        26.67
      31.215     0.968750         7584        32.00
      32.207     0.971875         7608        35.56
      32.991     0.975000         7634        40.00
      33.855     0.978125         7658        45.71
      35.007     0.981250         7682        53.33
      36.479     0.984375         7706        64.00
      37.215     0.985938         7718        71.11
      37.919     0.987500         7732        80.00
      38.367     0.989062         7743        91.43
      39.103     0.990625         7755       106.67
      39.679     0.992188         7767       128.00
      40.159     0.992969         7773       142.22
      40.991     0.993750         7780       160.00
      41.343     0.994531         7786       182.86
      42.527     0.995313         7792       213.33
      43.743     0.996094         7798       256.00
      44.223     0.996484         7801       284.44
      45.087     0.996875         7804       320.00
      45.631     0.997266         7807       365.71
      46.879     0.997656         7811       426.67
      47.903     0.998047         7813       512.00
      48.255     0.998242         7815       568.89
      48.383     0.998437         7816       640.00
      49.567     0.998633         7818       731.43
      49.855     0.998828         7819       853.33
      50.687     0.999023         7821      1024.00
      52.223     0.999121         7822      1137.78
      52.223     0.999219         7822      1280.00
      52.799     0.999316         7823      1462.86
      53.919     0.999414         7824      1706.67
      54.367     0.999512         7825      2048.00
      54.367     0.999561         7825      2275.56
      54.367     0.999609         7825      2560.00
      55.359     0.999658         7826      2925.71
      55.359     0.999707         7826      3413.33
      61.279     0.999756         7827      4096.00
      61.279     0.999780         7827      4551.11
      61.279     0.999805         7827      5120.00
      61.279     0.999829         7827      5851.43
      61.279     0.999854         7827      6826.67
      67.327     0.999878         7828      8192.00
      67.327     1.000000         7828          inf
#[Mean    =       14.214, StdDeviation   =        7.268]
#[Max     =       67.264, Total count    =         7828]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15843 requests in 20.00s, 5.47MB read
  Non-2xx or 3xx responses: 15843
Requests/sec:    792.16
Transfer/sec:    280.04KB


[root@fa21-cs523-17 wrk2]# ./wrk -D exp -t 1 -c 100 -d 20 -L -s ./scripts/media-microservices/compose-review.lua http://localhost:8080/wrk2-api/review/compose -R 800
Running 20s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread calibration: mean lat.: 15.514ms, rate sampling interval: 54ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.73ms    8.72ms  45.38ms   79.30%
    Req/Sec   800.37    114.11     1.07k    71.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.30ms
 75.000%   18.53ms
 90.000%   25.98ms
 99.000%   45.38ms
 99.900%   62.65ms
 99.990%   91.65ms
 99.999%   97.54ms
100.000%   97.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.351     0.000000            1         1.00
       6.479     0.100000          786         1.11
       7.967     0.200000         1572         1.25
       9.303     0.300000         2356         1.43
      10.695     0.400000         3141         1.67
      12.295     0.500000         3930         2.00
      13.295     0.550000         4319         2.22
      14.415     0.600000         4711         2.50
      15.583     0.650000         5105         2.86
      16.959     0.700000         5498         3.33
      18.527     0.750000         5890         4.00
      19.535     0.775000         6087         4.44
      20.383     0.800000         6284         5.00
      21.423     0.825000         6479         5.71
      22.639     0.850000         6675         6.67
      23.935     0.875000         6871         8.00
      24.911     0.887500         6969         8.89
      25.983     0.900000         7066        10.00
      26.927     0.912500         7165        11.43
      28.095     0.925000         7263        13.33
      29.519     0.937500         7362        16.00
      30.207     0.943750         7410        17.78
      31.375     0.950000         7459        20.00
      32.527     0.956250         7509        22.86
      33.503     0.962500         7557        26.67
      35.071     0.968750         7606        32.00
      36.095     0.971875         7632        35.56
      37.631     0.975000         7655        40.00
      38.879     0.978125         7680        45.71
      40.159     0.981250         7704        53.33
      42.079     0.984375         7729        64.00
      42.815     0.985938         7741        71.11
      43.903     0.987500         7753        80.00
      44.671     0.989062         7766        91.43
      46.111     0.990625         7778       106.67
      47.327     0.992188         7790       128.00
      48.063     0.992969         7797       142.22
      49.247     0.993750         7802       160.00
      50.111     0.994531         7809       182.86
      50.783     0.995313         7815       213.33
      53.567     0.996094         7821       256.00
      54.527     0.996484         7825       284.44
      55.455     0.996875         7827       320.00
      56.447     0.997266         7830       365.71
      58.015     0.997656         7833       426.67
      58.975     0.998047         7836       512.00
      59.903     0.998242         7838       568.89
      59.967     0.998437         7839       640.00
      60.831     0.998633         7841       731.43
      61.983     0.998828         7842       853.33
      66.815     0.999023         7844      1024.00
      70.399     0.999121         7845      1137.78
      70.399     0.999219         7845      1280.00
      77.567     0.999316         7846      1462.86
      83.583     0.999414         7847      1706.67
      86.079     0.999512         7848      2048.00
      86.079     0.999561         7848      2275.56
      86.079     0.999609         7848      2560.00
      86.527     0.999658         7849      2925.71
      86.527     0.999707         7849      3413.33
      91.647     0.999756         7850      4096.00
      91.647     0.999780         7850      4551.11
      91.647     0.999805         7850      5120.00
      91.647     0.999829         7850      5851.43
      91.647     0.999854         7850      6826.67
      97.535     0.999878         7851      8192.00
      97.535     1.000000         7851          inf
#[Mean    =       14.730, StdDeviation   =        8.720]
#[Max     =       97.472, Total count    =         7851]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15865 requests in 20.00s, 5.48MB read
  Non-2xx or 3xx responses: 15865
Requests/sec:    793.19
Transfer/sec:    280.40KB